
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВычислитьСуммарныйБюджет(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура БюджетНаличныйПриИзменении(Элемент)
	
	ВычислитьСуммарныйБюджет(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БюджетБезналичныйПриИзменении(Элемент)
	
	ВычислитьСуммарныйБюджет(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ВычислитьСуммарныйБюджет(ЭтаФорма)
	
	Объект = ЭтаФорма.Объект;
	
	ЭтаФорма.СуммарныйБюджет = Объект.БюджетНаличный + Объект.БюджетБезналичный;	
	
КонецПроцедуры

#КонецОбласти