
// Метод предназначен для заполнения полей при создании документов
//
// Параметры:
//  Источник			 - 	 - 
//  ДанныеЗаполнения	 - 	 - 
//  ТекстЗаполнения		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаЗаполнения(Источник, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
		
	// Заполнение ответственного
	МетаданныеОбъекта = Источник.Метаданные();
	Найденное = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(МетаданныеОбъекта);
	Если Найденное <> Неопределено Тогда
		Если Найденное.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать Тогда
			Источник.Ответственный = Пользователи.ТекущийПользователь();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
