
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

#Область ОбработчикиСобытийОбъекта

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.БалансОбъектовСтроительства.Записывать = Истина;
	
	Движение = Движения.БалансОбъектовСтроительства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Объект = Объект;
	Движение.Контрагент = Контрагент;
	Движение.ТипПлатежа = ТипПлатежа;
	Движение.СтатьяДоходовРасходов = СтатьяДоходов;
	Движение.Количество = Сумма;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Объекты") Тогда
		Объект = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти