
// Получение цены номенклатуры на дату
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура
//  Город		- СправочникСсылка.Город - Город								 - 
//  Период	   - Неопределено, Дата - Если Неопределено, срез будет на текущую дату системы
// 
// Возвращаемое значение:
//  Число - Цена номенклатуры
//
Функция Цена(Ссылка, Город, Период = Неопределено) Экспорт
	
	Результат = 0;
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, ) КАК ЦеныНоменклатурыСрезПоследних
		|ГДЕ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура = &Номенклатура
		|	И ЦеныНоменклатурыСрезПоследних.Город = &Город";
	
	Запрос.УстановитьПараметр("Период", Период);	
	Запрос.УстановитьПараметр("Номенклатура", Ссылка);
	Запрос.УстановитьПараметр("Город", Город);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат = Выборка.Цена;	
		КонецЦикла;
	Иначе
		Результат = Ссылка.ЦенаПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции