
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

#Область ОбработчикиСобытийОбъекта

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Взаиморасчеты.Записывать = Истина;
	
	Движение = Движения.Взаиморасчеты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Объект = Объект;
	Движение.Контрагент = Контрагент;
	Движение.Количество = Сумма;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеДенежныхСредств") Тогда
		Объект     = ДанныеЗаполнения.Объект;
		Контрагент = ДанныеЗаполнения.Контрагент;
		
		Если ДанныеЗаполнения.ТипПлатежа = Перечисления.ТипыПлатежей.Безналичный Тогда
			НоваяСтрока = Состав.Добавить();
			НоваяСтрока.Статья = ДанныеЗаполнения.СтатьяРасходов;
			НоваяСтрока.Сумма  = ДанныеЗаполнения.Сумма;
		КонецЕсли;		
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = 0;
	Для Каждого Строка Из Состав Цикл
		Сумма = Сумма + Строка.Сумма;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти