
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = Объект.Ссылка.ДанныеСообщения.Получить();
	Размер = СтрДлина(Данные);
	Если Размер <> 0 Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		Данные.Записать(ИмяВременногоФайла);
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
		ТекстСообщения = ТекстовыйДокумент.ПолучитьТекст();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Сообщения интегрированных систем можно создавать только вызовом операций веб-сервиса DMMessages.'"));
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры
