
Функция ПоПредставлениюCloud(Представление) Экспорт
	
	Результат = Перечисления.ВидыНоменклатуры.ПустаяСсылка();
	
	Если НРег(Представление) = НРег("MATERIAL") Тогда
		Результат = Перечисления.ВидыНоменклатуры.Материал;
		
	ИначеЕсли НРег(Представление) = НРег("SERVICE") Тогда
		Результат = Перечисления.ВидыНоменклатуры.Работа;
		
	ИначеЕсли НРег(Представление) = НРег("MECHANISM") Тогда
		Результат = Перечисления.ВидыНоменклатуры.Механизм;
				
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестное представление'");
	
	КонецЕсли;	

	Возврат Результат;	
	
КонецФункции